# What's happening in SA

In [224]:
import pandas as pd
import numpy as np

import requests
from bs4 import BeautifulSoup

## Acquire

Obatined COVID data for Bexar county here: https://www.sanantonio.gov/Health/News/Alerts/CoronaVirus#281783804-public-info- 

I'm glad they're posting the COVID data for people's consumption. However, it's not available in a csv or json or api for the data scientist. #thanksbutnothanks 

Time to webscrape.

In [225]:
response = requests.get("https://www.sanantonio.gov/Health/News/Alerts/CoronaVirus#281783804-public-info-")

In [226]:
soup = BeautifulSoup(response.text, 'html.parser')

In [227]:
table = soup.find_all("table",{"class":"covidData"})

In [228]:
def make_df(table_no):
    data = []

    table_title = table[table_no].find('thead')
    table_body = table[table_no].find('tbody')

    rows = table_title.find_all('tr')

    for row in rows:
        titles = row.find_all('th')
        header = []
        for title in titles[:2]:
            header.append(title.text)

    rows = table_body.find_all('tr')

    for row in rows:
        name = row.find('th').text
        name = name.strip()

        col = row.find('td').text
        data.append([name, col])

    return pd.DataFrame(data, columns=header)

## Prepare

### Totals in Bexar County

#### Total Cases

In [244]:
make_df(0)

    Case Status and Source of Exposure Number
0  Total Confirmed cases Bexar County*    168
1                       Travel-related     63
2                        Close contact     26
3               Community transmission     57
4                  Under investigation     22

#### Total Tests

In [245]:
make_df(7)

  Testing by Metro Health Laboratory Number
0                           Negative    562
1                           Positive     62
2                       Inconclusive      1
3   Total tested by Metro Health Lab    625

#### Hopitalizations

This one is breaking.

In [246]:
table_body = table[1].find('tbody')
rows = table_body.find_all('tr')

for row in rows:
    head = row.find('th')
#     print('this is the head:', head)
    if head != None:
        head = head.text.strip()
        print('head:', head)
#         print(head)
    col = row.find('td').text.strip()
    print('col :', col)
    print('')
#     data.append([head, col])
# data

col : Not Hospitalized

head: Drive Through
col : Drive Through
20
21%


Clinic/Provider
31
33%


Urgent Care/
                        Emergency Department
44
46%

head: Drive Through
col : 20

head: Clinic/Provider
col : 31

head: Urgent Care/
                        Emergency Department
col : 44

col : Ever Hospitalized

head: ICU
col : ICU
21
40%


On Ventilator
15
29%

head: ICU
col : 21

head: On Ventilator
col : 15

### Confirmed Cases

#### Gender

In [231]:
make_df(2)

   Gender Number\n            of Cases
0    Male                           89
1  Female                           79

#### Age

In [232]:
make_df(3)

  Age Group\n            (in years) Number
0                              0-19      7
1                             20-29     27
2                             30-39     20
3                             40-49     37
4                             50-59     29
5                             60-69     27
6                             70-79     18
7                             80-89      3

### Zip Code

This one is also breaking.

In [235]:
# make_df(8)

### Death Case Information

#### Total

In [236]:
make_df(4)

  Case Status Number
0   Recovered     44
1   Still Ill    119
2    Deceased      5

#### By Gender

In [237]:
make_df(5)

   Gender Number
0    Male      0
1  Female      5

#### By Age

In [238]:
make_df(6)

  Age Group\n            (in years) Number
0                              0-19      0
1                             20-29      0
2                             30-39      0
3                             40-49      2
4                             50-59      1
5                             60-69      1
6                             70-79      0
7                             80-89      1